driver-tests/iepse/IEPTupleBasedWindow/TupleBasedWindowApp/test/ContiguousOrderInput/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:str="ContiguousOrderInput.ContiguousOrderInput_iep">
   <soapenv:Header/>
   <soapenv:Body>
      <str:StreamInput0_MsgObj>
         <aInt1>${aInt1.0}</aInt1>
         <aBigint1>${aBigint1.0}</aBigint1>
         <double1>${double1.0}</double1>
         <varchar1>${varchar1.0}</varchar1>
         <date1>${date1.0}</date1>
         <ts1>${ts1.0}</ts1>
      </str:StreamInput0_MsgObj>
   </soapenv:Body>
</soapenv:Envelope>