driver-tests/iepse/IEPStreamProjectionAndFilter/StreamProjectionAndFilterApp/test/ContiguousOrderInput/template.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:del="ContiguousOrderInput.ContiguousOrderInput_iep">
  <soapenv:Body>
    <del:StreamInput0_MsgObj>
      <LastName>${LastName.0}</LastName>
      <MiddleInit>${MiddleInit.0}</MiddleInit>
      <RegNum>${RegNum.0}</RegNum>
      <Income>${Income.0}</Income>
      <RegionNum>${RegionNum.0}</RegionNum>
      <SDate>${SDate.0}</SDate>
      <STime>${STime.0}</STime>
      <STimestamp>${STimestamp.0}</STimestamp>
      <SDesc>${SDesc.0}</SDesc>
    </del:StreamInput0_MsgObj>
  </soapenv:Body>
</soapenv:Envelope>